# ExtraFaceAndEdgeHistoryKey Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOptions..::..ExtraFaceAndEdgeHistoryKey Property
SolidOptions Class See Also
---
Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int ExtraFaceAndEdgeHistoryKey { get; set; }
```

Visual Basic
---
```text
Public Property ExtraFaceAndEdgeHistoryKey As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ExtraFaceAndEdgeHistoryKey {
	int get ();
	void set (int value);
}
```

# See Also
SolidOptions Class
Autodesk.Revit.DB Namespace